[
  {
    "id": 1,
    "title": "ಕೃತಕ ಬುದ್ಧಿಮತ್ತೆ: ಮುಂದಿನ ದಶಕದ ತಂತ್ರಜ್ಞಾನ ಕ್ರಾಂತಿ",
    "excerpt": "ಕೃತಕ ಬುದ್ಧಿಮತ್ತೆಯು ಹೇಗೆ ನಮ್ಮ ಜೀವನವನ್ನು ಬದಲಾಯಿಸುತ್ತಿದೆ ಎಂಬುದರ ಕುರಿತು ಈ ಲೇಖನವು ವಿವರಿಸುತ್ತದೆ.",
    "content": "<p>ಕೃತಕ ಬುದ್ಧಿಮತ್ತೆ (AI) ಎಂಬುದು ಕಂಪ್ಯೂಟರ್ ವಿಜ್ಞಾನದ ಒಂದು ಶಾಖೆಯಾಗಿದ್ದು, ಇದು ಮಾನವರಂತೆ ಯೋಚಿಸುವ ಮತ್ತು ಕಾರ್ಯನಿರ್ವಹಿಸುವ ವ್ಯವಸ್ಥೆಗಳನ್ನು ರಚಿಸುವುದರ ಮೇಲೆ ಕೇಂದ್ರೀಕರಿಸಿದೆ. ಇತ್ತೀಚಿನ ವರ್ಷಗಳಲ್ಲಿ, AI ತಂತ್ರಜ್ಞಾನದಲ್ಲಿ ಅದ್ಭುತ ಪ್ರಗತಿಯನ್ನು ಕಂಡಿದೆ, ಇದು ವಿವಿಧ ಕ್ಷೇತ್ರಗಳಲ್ಲಿ ಕ್ರಾಂತಿಯನ್ನುಂಟುಮಾಡಿದೆ.</p><p>ಕರ್ನಾಟಕದಲ್ಲಿ, ಬೆಂಗಳೂರು ಸಿಲಿಕಾನ್ ವ್ಯಾಲಿಯಂತಹ ತಂತ್ರಜ್ಞಾನ ಕೇಂದ್ರಗಳು AI ಸಂಶೋಧನೆ ಮತ್ತು ಅಭಿವೃದ್ಧಿಗೆ ಮುಂಚೂಣಿಯಲ್ಲಿವೆ. ಸ್ಥಳೀಯ ಸ್ಟಾರ್ಟಪ್ಗಳು ಮತ್ತು ಸಂಶೋಧನಾ ಸಂಸ್ಥೆಗಳು ಆರೋಗ್ಯ ಸೇವೆಗಳಿಂದ ಹಿಡಿದು ಕೃಷಿ, ಶಿಕ್ಷಣ ಮತ್ತು ಸರ್ಕಾರಿ ಸೇವೆಗಳವರೆಗೆ ವಿವಿಧ ಕ್ಷೇತ್ರಗಳಲ್ಲಿ AI ಪರಿಹಾರಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುತ್ತಿವೆ.</p>",
    "category": "AI News",
    "date": "2025-09-20T10:00:00.000Z",
    "image": "https://images.unsplash.com/photo-1677442135136-760c813a743d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&q=80",
    "author": "ರಾಜೇಶ್ ಕುಮಾರ್",
    "readTime": "3 ನಿಮಿಷಗಳು"
  },
  {
    "id": 2,
    "title": "ಕನ್ನಡದಲ್ಲಿ AI: ನಮ್ಮ ಭಾಷೆಯನ್ನು ಉಳಿಸಿಕೊಳ್ಳುವುದು",
    "excerpt": "ಕನ್ನಡ ಭಾಷೆಯನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಮತ್ತು ಉತ್ತಮಗೊಳಿಸಲು AI ಹೇಗೆ ಸಹಾಯ ಮಾಡುತ್ತದೆ ಎಂಬುದರ ಕುರಿತು ಈ ಲೇಖನ.",
    "content": "<p>ಕನ್ನಡವು ಶ್ರೀಮಂತ ಸಾಹಿತ್ಯಿಕ ಪರಂಪರೆಯನ್ನು ಹೊಂದಿರುವ ಪ್ರಾಚೀನ ಭಾಷೆಯಾಗಿದೆ. ಆದಾಗ್ಯೂ, ಡಿಜಿಟಲ್ ಯುಗದಲ್ಲಿ, ಕನ್ನಡವು ಹಲವಾರು ಸವಾಲುಗಳನ್ನು ಎದುರಿಸುತ್ತಿದೆ. ಇಲ್ಲಿ AI ನಮ್ಮ ಭಾಷೆಯನ್ನು ಉಳಿಸಿಕೊಳ್ಳಲು ಮತ್ತು ಉತ್ತಮಗೊಳಿಸಲು ಹೇಗೆ ಸಹಾಯ ಮಾಡುತ್ತದೆ ಎಂಬುದನ್ನು ನಾವು ನೋಡೋಣ.</p><p>ಕನ್ನಡದಲ್ಲಿ AI-ಆಧಾರಿತ ಚಾಟ್ಬಾಟ್ಗಳು, ಭಾಷಾ ಅನುವಾದಕಗಳು ಮತ್ತು ಧ್ವನಿ ಗುರುತಿಸುವಿಕೆ ವ್ಯವಸ್ಥೆಗಳು ಹೆಚ್ಚು ಪ್ರಾಮುಖ್ಯತೆಯನ್ನು ಪಡೆದಿವೆ. IIT ಧಾರವಾಡ ಮತ್ತು IIIT ಬೆಂಗಳೂರು ನಮ್ಮ ಭಾಷೆಗೆ AI ಪರಿಹಾರಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುವಲ್ಲಿ ಮುಂಚೂಣಿಯಲ್ಲಿವೆ.</p>",
    "category": "ಕರ್ನಾಟಕ ತಂತ್ರಜ್ಞಾನ",
    "date": "2025-09-18T15:30:00.000Z",
    "image": "https://images.unsplash.com/photo-1620712943543-bcc4688e7485?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=765&q=80",
    "author": "ಪ್ರಿಯಾ ಶೆಟ್ಟಿ",
    "readTime": "4 ನಿಮಿಷಗಳು"
  },
  {
    "id": 3,
    "title": "AI ಮತ್ತು ಕೃಷಿ: ಕನ್ನಡ ನಾಡಿನ ರೈತರಿಗೆ ಹೊಸ ಭರವಸೆ",
    "excerpt": "ಕೃಷಿ ಕ್ಷೇತ್ರದಲ್ಲಿ AI ಹೇಗೆ ಕ್ರಾಂತಿಯನ್ನುಂಟುಮಾಡುತ್ತಿದೆ ಮತ್ತು ಕನ್ನಡ ನಾಡಿನ ರೈತರಿಗೆ ಹೇಗೆ ಸಹಾಯ ಮಾಡುತ್ತಿದೆ ಎಂಬುದರ ಕುರಿತು ಈ ಲೇಖನ.",
    "content": "<p>ಕರ್ನಾಟಕದ ಹಲವಾರು ಭಾಗಗಳಲ್ಲಿ, ರೈತರು ತಮ್ಮ ಬೆಳೆಗಳನ್ನು ನಿರ್ವಹಿಸಲು ಮತ್ತು ಲಾಭದಾಯಕವಾಗಿಸಲು AI ತಂತ್ರಜ್ಞಾನವನ್ನು ಬಳಸುತ್ತಿದ್ದಾರೆ. ಡ್ರೋನ್ಗಳು, ಸೆನ್ಸರ್ಗಳು ಮತ್ತು ಮಸ್ಕಿನ್ ಲರ್ನಿಂಗ್ ಅಲ್ಗಾರಿದಮ್ಗಳು ರೈತರಿಗೆ ಹವಾಮಾನದ ಬದಲಾವಣೆಗಳನ್ನು ಊಹಿಸಲು, ಕೀಟಗಳ ಹಾವಳಿಯನ್ನು ಗುರುತಿಸಲು ಮತ್ತು ನೀರಿನ ಬಳಕೆಯನ್ನು ಅತ್ಯುತ್ತಮವಾಗಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತಿವೆ.</p><p>ಕರ್ನಾಟಕ ಸರ್ಕಾರವು 'ಕೃಷಿ ತಂತ್ರಜ್ಞಾನ ಮತ್ತು ಇನೊವೇಷನ್ ಫೆಲೋಶಿಪ್' ಅನ್ನು ಪ್ರಾರಂಭಿಸಿದೆ, ಇದು ರೈತರಿಗೆ AI-ಆಧಾರಿತ ಪರಿಹಾರಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ಈ ಯೋಜನೆಯು ಯುವ ತಜ್ಞರಿಗೆ ಕೃಷಿ ಸಮಸ್ಯೆಗಳಿಗೆ ತಾಂತ್ರಿಕ ಪರಿಹಾರಗಳನ್ನು ರಚಿಸಲು ಅವಕಾಶ ನೀಡುತ್ತದೆ.</p>",
    "category": "AI ಟೆಕ್",
    "date": "2025-09-17T09:15:00.000Z",
    "image": "https://images.unsplash.com/photo-1500382017468-9049fed747ef?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1632&q=80",
    "author": "ಮನೋಜ್ ಕುಮಾರ್",
    "readTime": "5 ನಿಮಿಷಗಳು"
  },
  {
    "id": 4,
    "title": "ಬೆಂಗಳೂರಿನ AI ಸ್ಟಾರ್ಟಪ್ಗಳು: ಜಾಗತಿಕ ಮಟ್ಟದಲ್ಲಿ ಗುರುತಿಸಿಕೊಂಡಿವೆ",
    "excerpt": "ಬೆಂಗಳೂರಿನ AI ಸ್ಟಾರ್ಟಪ್ಗಳು ಹೇಗೆ ಜಾಗತಿಕ ಮಟ್ಟದಲ್ಲಿ ಗುರುತಿಸಿಕೊಂಡಿವೆ ಮತ್ತು ಅವುಗಳ ಯಶಸ್ಸಿನ ಕಥೆಗಳ ಬಗ್ಗೆ ಈ ಲೇಖನ.",
    "content": "<p>ಬೆಂಗಳೂರು, ಇಂದು ಭಾರತದ ಸಿಲಿಕಾನ್ ವ್ಯಾಲಿ ಎಂದು ಹೆಸರಾಗಿದೆ, ಇಲ್ಲಿ ನೂರಾರು AI ಸ್ಟಾರ್ಟಪ್ಗಳು ತಮ್ಮ ತಾಂತ್ರಿಕ ಪರಿಹಾರಗಳೊಂದಿಗೆ ಹೊರಹೊಮ್ಮುತ್ತಿವೆ. ಸ್ವಾಸ್ಥ್ಯ ಸಂರಕ್ಷಣೆಯಿಂದ ಹಿಡಿದು ಹಣಕಾಸು ಸೇವೆಗಳವರೆಗೆ, ಈ ಸ್ಟಾರ್ಟಪ್ಗಳು ವಿವಿಧ ಕ್ಷೇತ್ರಗಳಲ್ಲಿ ನಾವೀನ್ಯತೆಯನ್ನು ತಂದಿವೆ.</p><p>ಕೆಲವು ಗಮನಾರ್ಹ AI ಸ್ಟಾರ್ಟಪ್ಗಳಲ್ಲಿ ಸಿಗ್ನಲ್ ಚಿಪ್ (ಆಟೋಮೋಟಿವ್ AI), ನಿರಮತಿ ರೊಬೊಟಿಕ್ಸ್ (ಕೈಗಾರಿಕಾ ರೊಬೊಟಿಕ್ಸ್), ಮತ್ತು ಹ್ಯಾಪಿ ಫಾರೆಸ್ಟ್ (ಆರೋಗ್ಯ ತಂತ್ರಜ್ಞಾನ) ಸೇರಿವೆ. ಈ ಕಂಪನಿಗಳು ಜಾಗತಿಕ ಮಟ್ಟದಲ್ಲಿ ಗುರುತಿಸಿಕೊಂಡು, ಹೆಚ್ಚುತ್ತಿರುವ ತಂತ್ರಜ್ಞಾನ ಕ್ಷೇತ್ರದಲ್ಲಿ ಕರ್ನಾಟಕವನ್ನು ಪ್ರಮುಖ ಆಟಗಾರನನ್ನಾಗಿ ಮಾಡಿವೆ.</p>",
    "category": "ಸ್ಟಾರ್ಟಪ್",
    "date": "2025-09-16T14:20:00.000Z",
    "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1470&q=80",
    "author": "ಸುಮನ್ ರಾವ್",
    "readTime": "4 ನಿಮಿಷಗಳು"
  },
  {
    "id": 5,
    "title": "ಕನ್ನಡದಲ್ಲಿ AI ಚಾಟ್ಬಾಟ್ಗಳು: ಸವಾಲುಗಳು ಮತ್ತು ಅವಕಾಶಗಳು",
    "excerpt": "ಕನ್ನಡದಲ್ಲಿ AI ಚಾಟ್ಬಾಟ್ಗಳನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸುವಲ್ಲಿ ಇರುವ ಸವಾಲುಗಳು ಮತ್ತು ಅವಕಾಶಗಳ ಬಗ್ಗೆ ಈ ಲೇಖನ.",
    "content": "<p>ಕನ್ನಡದಂತಹ ಕಡಿಮೆ-ಸಂಪನ್ಮೂಲ ಹೊಂದಿರುವ ಭಾಷೆಗಳಿಗೆ AI-ಆಧಾರಿತ ಚಾಟ್ಬಾಟ್ಗಳನ್ನು ರಚಿಸುವುದು ಹಲವಾರು ಸವಾಲುಗಳನ್ನು ಹೊಂದಿದೆ. ಇವುಗಳಲ್ಲಿ ದೊಡ್ಡ ಸವಾಲು ಎಂದರೆ ಭಾಷಾ ಡೇಟಾದ ಕೊರತೆ. ಆದಾಗ್ಯೂ, ಇತ್ತೀಚಿನ ವರ್ಷಗಳಲ್ಲಿ, ಸರ್ಕಾರಿ ಮತ್ತು ಖಾಸಗಿ ಸಂಸ್ಥೆಗಳು ಕನ್ನಡ ಭಾಷಾ ಡೇಟಾಸೆಟ್ಗಳನ್ನು ರಚಿಸುವತ್ತ ಗಮನ ಹರಿಸಿವೆ.</p><p>IIIT ಬೆಂಗಳೂರು ಮತ್ತು IISC ನಂತರದ ಸಂಶೋಧನಾ ಸಂಸ್ಥೆಗಳು ಕನ್ನಡದಲ್ಲಿ ನೈಸರ್ಗಿಕ ಭಾಷಾ ಪ್ರಕ್ರಿಯೆಗಾಗಿ ತರಬೇತಿ ನೀಡಲು ದೊಡ್ಡ ಪ್ರಮಾಣದ ಡೇಟಾಸೆಟ್ಗಳನ್ನು ರಚಿಸಿವೆ. ಇದು ಕನ್ನಡದಲ್ಲಿ ಹೆಚ್ಚು ನಿಖರವಾದ ಮತ್ತು ಸಹಜ ಭಾಷಾ ಮಾದರಿಗಳ ಅಭಿವೃದ್ಧಿಗೆ ದಾರಿ ಮಾಡಿಕೊಟ್ಟಿದೆ.</p>",
    "category": "ಬ್ಲಾಗ್ಗಳು",
    "date": "2025-09-15T11:45:00.000Z",
    "image": "https://images.unsplash.com/photo-1677442136019-21780ecad995?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1469&q=80",
    "author": "ನಿಧಿ ಪಾಟೀಲ್",
    "readTime": "6 ನಿಮಿಷಗಳು"
  },
  {
    "id": 1758524215510,
    "title": "Karnataka Launches India’s First AI-Powered Integrated City",
    "excerpt": "Karnataka unveils a futuristic AI-powered integrated township near Bengaluru, marking India's bold leap into AI-driven urban developmen",
    "category": "ai-tech",
    "date": "2025-09-22T06:56:55.024Z",
    "image": "https://www.moneycontrol.com/news/india/karnataka-to-establish-ai-powered-integrated-city-near-bengaluru-13522645.htm",
    "createdAt": "2025-09-22T06:56:55.510Z"
  }
]